In [1]:
import pandas as pd

# there are 2 data-types

In [2]:
series = pd.Series(['BWM','Honda','Mercedes'])
series

0         BWM
1       Honda
2    Mercedes
dtype: object

this this is the 1-dimensional

In [3]:
colours = pd.Series(['red','black','white'])

In [4]:
colours

0      red
1    black
2    white
dtype: object

# Creating the data frame with 2 series

In [5]:
car_data = pd.DataFrame({'Comany':series,'colour':colours})
car_data

     Comany colour
0       BWM    red
1     Honda  black
2  Mercedes  white

## this is how we create a data frame from the series data.

In [ ]:
heart_disease = pd.read_csv('https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/refs/heads/master/data/heart-disease.csv')

In [ ]:
heart_disease

# Describe

In [ ]:
car_data.describe()

In [ ]:
car_data.dtypes

In [ ]:
car_data.columns

In [ ]:
car_data.info()

In [9]:
car_sales = pd.read_csv('car-sales.csv')

In [10]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [11]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

# .loc and .iloc

In [12]:
animals = pd.Series(['cat','dog','bird','panda','sanke'],index=[1,2,3,4,5])

In [14]:
animals.head()

1      cat
2      dog
3     bird
4    panda
5    sanke
dtype: object

## (iloc refers to the position) and (loc refers to the index)

In [15]:
animals.loc[3]

'bird'

In [16]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [17]:
animals.iloc[3]

'panda'

In [18]:
pd.crosstab(car_sales['Make'], car_sales['Doors'])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

#groupy by

In [20]:
car_sales.groupby(['Make']).mean(numeric_only=True)

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75